#+STARTUP: overview
http://www.org.org

* COMMENT debugging agenda

#+BEGIN_SRC emacs-lisp
(setq org-agenda-files '("/Volumes/t2a/DebugEmacsAgenda" "/Volumes/t2a/DebugEmacsAgenda/journal"))
#+END_SRC

#+RESULTS:
| /Volumes/t2a/DebugEmacsAgenda | /Volumes/t2a/DebugEmacsAgenda/journal |

#+BEGIN_SRC emacs-lisp
(setq org-agenda-files '("/Users/iani/BitTorrent Sync/000WORKFILES/PERSONAL/journal"))
#+END_SRC

#+RESULTS:
| /Users/iani/BitTorrent Sync/000WORKFILES/PERSONAL/journal |

#+BEGIN_SRC emacs-lisp
(setq org-agenda-files '("/Users/iani/journal"))
#+END_SRC

#+RESULTS:
| /Users/iani/journal |

#+BEGIN_SRC emacs-lisp

(setq org-journal-dir (file-truename "~/Documents/000WORKFILES/PERSONAL/journal"))

(setq org-agenda-files `(,org-journal-dir
                         ,org-todo-dir
                         ,org-projects-dir))
#+END_SRC

#+RESULTS:
| /Users/iani/BitTorrent Sync/000WORKFILES/PERSONAL/journal | /Users/iani/BitTorrent Sync/000WORKFILES/PERSONAL/TODOS | /Users/iani/BitTorrent Sync/000WORKFILES/PROJECTS_CURRENT |
